БухЭксп/Reports/CW_ЛичныйКабинетСтатистика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ЛичныйКабинетСтатистика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Reports/CW_ЛичныйКабинетСтатистика/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Пользователь", 	Отчет.Пользователь);
	Параметры.Свойство("ВариантОтчета", Отчет.ВариантОтчета);
	
	ПериодОтчета.ДатаНачала		= НачалоМесяца(ТекущаяДата());
	ПериодОтчета.ДатаОкончания 	= ТекущаяДата();  
	
	Отчет.Периодичность = 3;
	
	тОтчет = РеквизитФормыВЗначение("Отчет");
	СКД = тОтчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Для Каждого ВариантНастроек Из СКД.ВариантыНастроек Цикл
		Элементы.ВариантОтчета.СписокВыбора.Добавить(ВариантНастроек.Имя, ВариантНастроек.Представление);
	КонецЦикла;
	
	Если ПустаяСтрока(Отчет.ВариантОтчета) Тогда
		Если Элементы.ВариантОтчета.СписокВыбора.Количество() > 0 Тогда
			Отчет.ВариантОтчета = Элементы.ВариантОтчета.СписокВыбора[0].Значение;
		КонецЕсли;                            
	КонецЕсли;
	
	ПоказатьСкрытьНастройкиНаФорме();
	УстановитьВидимостьЭлементов();
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ЭлементСписка = Элементы.ВариантОтчета.СписокВыбора.НайтиПоЗначению(Отчет.ВариантОтчета);
	
	Заголовок = "Личный кабинет клиента. Статистика использования ("+ЭлементСписка.Представление+")";

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	
	Отчет.НачалоПериода = ПериодОтчета.ДатаНачала;
	Отчет.КонецПериода = ПериодОтчета.ДатаОкончания;
	
	ЭтаФорма.СкомпоноватьРезультат();

КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	
	ОчиститьРезультат();
	УстановитьСостояниеРезультата();
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ОчиститьРезультат();
	УстановитьСостояниеРезультата();
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	
	ОчиститьРезультат();
	УстановитьСостояниеРезультата();
	УстановитьЗаголовокФормы();  
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимостьЭлементов()

	Элементы.Периодичность.Видимость = Отчет.ВариантОтчета = "АктивностьПользователей"; 
	Элементы.Пользователь.Видимость  = Отчет.ВариантОтчета = "АктивностьПользователя"; 
	
КонецПроцедуры

&наСервере
Процедура ОчиститьРезультат()
	
	Результат.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеРезультата()
	
	Элементы.Результат.ОтображениеСостояния.Видимость = Истина;
	Элементы.Результат.ОтображениеСостояния.Текст = "Отчет не сформирован. Нажминте ""Сформировать"" для получения отчета...";	
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ПоказатьСкрытьНастройки = НЕ ПоказатьСкрытьНастройки;
	Элементы.ФормаНастройки.Пометка = ПоказатьСкрытьНастройки;
	
	ПоказатьСкрытьНастройкиНаФорме();
	
КонецПроцедуры

&наСервере
Процедура ПоказатьСкрытьНастройкиНаФорме()
	
	Элементы.ГруппаНастройки.Видимость = ПоказатьСкрытьНастройки;
	
КонецПроцедуры
